# WarnElevSheet Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ElevationFailures..::..WarnElevSheet Property
BuiltInFailures..::..ElevationFailures Class See Also
---
An elevation symbol references views on more than one sheet. It will show a blank sheet reference. To show the correct references, use a separate elevation symbol for the views on each sheet.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId WarnElevSheet { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WarnElevSheet As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ WarnElevSheet {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ElevationFailures Class
Autodesk.Revit.DB Namespace